package com.doct24.doct24_android.model.localrepo

import com.doct24.doct24_android.model.Feedback
import com.doct24.doct24_android.model.IFeedbackRepository

class LocalFeedbackRepository: IFeedbackRepository {
    override fun getFeedbacks(doctorID: Int): List<Feedback> {
        return listOf(
            Feedback(1,1,"Кондратьев Дмитрий", "22 июля 2021", "Очень хороший врач. Все проверил, проконсультировал. Я обращаюсь к этому врачу уже не первый раз и всегда доволен консультацией.", null, 4),
            Feedback(1,1,"Кочеткова Мария", "16 августа 2021", "Консультировалась с врачом по видео-связи, мне понравился и препараты, которые он мне выписал, помогают. Я довольная результатом.", null, 5),
            Feedback(1,1,"Кондратьев Дмитрий", "22 июля 2021", "Очень хороший врач. Все проверил, проконсультировал. Я обращаюсь к этому врачу уже не первый раз и всегда доволен консультацией.", null, 4),
            Feedback(1,1,"Кочеткова Мария", "16 августа 2021", "Консультировалась с врачом по видео-связи, мне понравился и препараты, которые он мне выписал, помогают. Я довольная результатом.", null, 5),
            Feedback(1,1,"Кондратьев Дмитрий", "22 июля 2021", "Очень хороший врач. Все проверил, проконсультировал. Я обращаюсь к этому врачу уже не первый раз и всегда доволен консультацией.", null, 4),
            Feedback(1,1,"Кочеткова Мария", "16 августа 2021", "Консультировалась с врачом по видео-связи, мне понравился и препараты, которые он мне выписал, помогают. Я довольная результатом.", null, 5),
        )
    }
}